function setup() {
  createCanvas(600, 400);
  background('#FFD4DF');
  
    // ===== 머리카락 (긴 생머리) =====
  fill('#3B1F06'); // 머리카락 색
  noStroke();
  rect(210, 150, 180, 240); // 
  ellipse(300, 150, 200, 220); // 앞머리 곡선
  
  // ===== 얼굴 =====
  fill(255, 230, 220); // 얼굴 색
  noStroke();
  ellipse(300, 180, 160, 180); // 얼굴

// ===== 네모 앞머리 =====
// 네모 갈래
  fill('#3B1F06');
  rect(220, 90, 50, 60); // 왼쪽
  rect(270, 80, 50, 70); // 중앙
  rect(320, 90, 60, 60); // 오른쪽

fill(255, 230, 220);
  triangle(300, 150, 305, 100, 310, 150);
  
  // ===== 귀 =====
  fill(255, 230, 220); // 얼굴과 같은 색
  ellipse(210, 180, 30, 40); // 왼쪽 귀
  ellipse(390, 180, 30, 40); // 오른쪽 귀

  // ===== 귀걸이 =====
  stroke(180); // 은색
  strokeWeight(3);
  noFill();
  ellipse(210, 200, 20, 20); // 왼쪽 귀걸이
  ellipse(390, 200, 20, 20); // 오른쪽 귀걸이
  noStroke();

  // ===== 눈 =====
  fill(255); 
  ellipse(265, 170, 50, 35); // 왼쪽 눈
  ellipse(335, 170, 50, 35); // 오른쪽 눈

  fill(0); 
  ellipse(265, 170, 25, 25); // 왼쪽 눈동자
  ellipse(335, 170, 25, 25); // 오른쪽 눈동자
  
  fill(255); 
  ellipse(270, 170, 7, 7); // 왼쪽 눈동자
  ellipse(340, 170, 7, 7); // 오른쪽 눈동자
// ===== 코 =====
  fill(240, 200, 190);
  triangle(295, 180, 305, 180, 300, 200);

  // ===== 입 =====
  fill(200, 50, 80);
  arc(300, 220, 60, 40, 0, PI); // 웃는 입
  
  // ===== 목 =====
  fill(255, 230, 220); // 얼굴과 같은 피부색
  rect(270, 240, 60, 70, 10);  
  
  fill(255);
  noStroke();

// ===== 몸통 =====
  fill('#091F92');
  rect(180, 280, 240, 180, 40);  // 몸통

  stroke('#000000');
  strokeWeight(1)

  fill('#FFFFFF');
  rect(170, 280, 60, 150, 50); 

  rect(380, 280, 60, 150, 50);
  fill(255); // 흰색 단추
  stroke(200); // 단추 테두리
  strokeWeight(2);
  ellipse(300, 330, 10, 10); // 위쪽 단추
  ellipse(300, 370, 10, 10); // 아래쪽 단추
  noStroke();
  
  stroke(255, 0, 0); // 빨간 외곽선
  strokeWeight(8)

  fill(255); 
  textSize(64);

  text("S", 320, 370);
}